In [1]:
import pandas as pd 
import numpy as np

In [2]:
dates = pd.date_range('20180701',periods=6) #dates in pandas
dates

DatetimeIndex(['2018-07-01', '2018-07-02', '2018-07-03', '2018-07-04',
               '2018-07-05', '2018-07-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df #dataframe with index as dates and columns as A B C D

                   A         B         C         D
2018-07-01  0.916838  1.250369 -0.738373 -1.574580
2018-07-02 -1.477445  0.159534  0.810896  0.046457
2018-07-03  0.715203  0.359675 -0.875288  1.420281
2018-07-04 -0.866745  0.033100 -0.171816  0.074927
2018-07-05 -0.966682  1.752195  1.211752 -0.088776
2018-07-06 -1.327326  0.038103 -0.416960  0.032794

<h1 style='color:#775588'>Selection</h1>
<br/>
<p style='color:red'>Note: While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for
interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc
and .iloc.</p>
<p>See the indexing documentation Indexing and Selecting Data and MultiIndex / Advanced Indexing</p>
<br />
<h3 style='color:#123456'>Selecting a single column, which yields a Series, equivalent to df.A:</h3>

In [4]:
df['A']

2018-07-01    0.916838
2018-07-02   -1.477445
2018-07-03    0.715203
2018-07-04   -0.866745
2018-07-05   -0.966682
2018-07-06   -1.327326
Freq: D, Name: A, dtype: float64

<h3 style='color:#123456'>Selecting via [], which slices the rows.</h3>

In [5]:
df[1:4]

                   A         B         C         D
2018-07-02 -1.477445  0.159534  0.810896  0.046457
2018-07-03  0.715203  0.359675 -0.875288  1.420281
2018-07-04 -0.866745  0.033100 -0.171816  0.074927

In [6]:
df['20180703':'20180705']

                   A         B         C         D
2018-07-03  0.715203  0.359675 -0.875288  1.420281
2018-07-04 -0.866745  0.033100 -0.171816  0.074927
2018-07-05 -0.966682  1.752195  1.211752 -0.088776

<h3 style='color:#123456'>Selection by Label<h3>

In [7]:
#For getting a cross section using a label
df.loc[dates[3]]

A   -0.866745
B    0.033100
C   -0.171816
D    0.074927
Name: 2018-07-04 00:00:00, dtype: float64

In [8]:
#SElecting on a multi - axis by label
df.loc[:,['A','B']]

                   A         B
2018-07-01  0.916838  1.250369
2018-07-02 -1.477445  0.159534
2018-07-03  0.715203  0.359675
2018-07-04 -0.866745  0.033100
2018-07-05 -0.966682  1.752195
2018-07-06 -1.327326  0.038103

In [9]:
#Showing label slicing, both endpoints are included:
df.loc['20180703':'20180705',['A','B']]

                   A         B
2018-07-03  0.715203  0.359675
2018-07-04 -0.866745  0.033100
2018-07-05 -0.966682  1.752195

In [10]:
#Reduction in the dimensions of the returned object:
df.loc['20180705',['A','B']]

A   -0.966682
B    1.752195
Name: 2018-07-05 00:00:00, dtype: float64

In [11]:
#For getting a scalar value:
df.loc[dates[0],'A']

0.91683806997701822

In [12]:
#For getting fast access to a scalar (equivalent to the prior method)
df.at[dates[0],'A']

0.91683806997701822

<h3 style='color:#123456'>Selection by Position</h3>

In [13]:
#Select via the position of the passed integers:
df.iloc[3]

A   -0.866745
B    0.033100
C   -0.171816
D    0.074927
Name: 2018-07-04 00:00:00, dtype: float64

In [14]:
#By integer slices, acting similar to numpy/python:
df.iloc[3:6,2:4]

                   C         D
2018-07-04 -0.171816  0.074927
2018-07-05  1.211752 -0.088776
2018-07-06 -0.416960  0.032794

In [15]:
#By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1,2,4],[0,2]]

                   A         C
2018-07-02 -1.477445  0.810896
2018-07-03  0.715203 -0.875288
2018-07-05 -0.966682  1.211752

In [16]:
#For slicing rows explicitly:
df.iloc[1:3,:]

                   A         B         C         D
2018-07-02 -1.477445  0.159534  0.810896  0.046457
2018-07-03  0.715203  0.359675 -0.875288  1.420281

In [17]:
#For slicing columns explicitly:
df.iloc[:,[0,2,3]]

                   A         C         D
2018-07-01  0.916838 -0.738373 -1.574580
2018-07-02 -1.477445  0.810896  0.046457
2018-07-03  0.715203 -0.875288  1.420281
2018-07-04 -0.866745 -0.171816  0.074927
2018-07-05 -0.966682  1.211752 -0.088776
2018-07-06 -1.327326 -0.416960  0.032794

In [18]:
#For getting a value explicitly:
df.iloc[2,2]

-0.87528846989018783

In [19]:
#For getting fast access to a scalar (equivalent to the prior method):
df.iat[2,2]

-0.87528846989018783

<h3 style='color:#123456'>Boolean Indexing<h3>

In [20]:
#operators which can be worked in condition

'''
>
<
>=
<=
==
!=
isin
&(and)
|(or)
~->nor
^->xor
any
all
not null

'''

'\n>\n<\n>=\n<=\n==\n!=\nisin\n&(and)\n|(or)\n~->nor\n^->xor\nany\nall\nnot null\n\n'

In [21]:
#Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2018-07-01  0.916838  1.250369 -0.738373 -1.574580
2018-07-03  0.715203  0.359675 -0.875288  1.420281

In [22]:
#Selecting values from a DataFrame where a boolean condition is met.
df[df>0]

                   A         B         C         D
2018-07-01  0.916838  1.250369       NaN       NaN
2018-07-02       NaN  0.159534  0.810896  0.046457
2018-07-03  0.715203  0.359675       NaN  1.420281
2018-07-04       NaN  0.033100       NaN  0.074927
2018-07-05       NaN  1.752195  1.211752       NaN
2018-07-06       NaN  0.038103       NaN  0.032794

In [23]:
#Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2018-07-01  0.916838  1.250369 -0.738373 -1.574580    one
2018-07-02 -1.477445  0.159534  0.810896  0.046457    one
2018-07-03  0.715203  0.359675 -0.875288  1.420281    two
2018-07-04 -0.866745  0.033100 -0.171816  0.074927  three
2018-07-05 -0.966682  1.752195  1.211752 -0.088776   four
2018-07-06 -1.327326  0.038103 -0.416960  0.032794  three

In [24]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2018-07-03  0.715203  0.359675 -0.875288  1.420281   two
2018-07-05 -0.966682  1.752195  1.211752 -0.088776  four

In [26]:
pd.isna(df2)

AttributeError: module 'pandas' has no attribute 'isna'